{
    "slug": "sweet-&-sour-mix-1766346173221",
    "name": "Sweet & Sour Mix",
    "description": "This recipe is simple to prepare and will keep for up to two to three weeks in the refrigerator. ",
    "github": "",
    "ingredients": [
        {
            "quantity": "½",
            "measure": "",
            "ingredient": "cup granulated sugar"
        },
        {
            "quantity": "½",
            "measure": "",
            "ingredient": "cup water"
        },
        {
            "quantity": "½",
            "measure": "",
            "ingredient": "cup fresh lemon juice (about 2-4 lemons)"
        },
        {
            "quantity": "½",
            "measure": "",
            "ingredient": "cup fresh lime juice (about 4-6 limes)"
        }
    ],
    "directions": [
        "Prepare the simple syrup: In a small saucepan over medium heat, combine the water and sugar. Stir constantly until the sugar is completely dissolved and the mixture is clear. Do not let it boil for too long, or you risk caramelizing the sugar.",
        "Cool: Remove the saucepan from the heat and allow the simple syrup to cool completely to room temperature.",
        "Add citrus: Once cooled, transfer the simple syrup to a jar or airtight container. Add the fresh lemon juice and lime juice.",
        "Mix and store: Seal the container and shake vigorously to combine all the ingredients. Store the sweet and sour mix in the refrigerator. ",
        "Tips for Success",
        "Fresh is Best: While bottled juice works in a pinch, freshly squeezed citrus offers a much more vibrant and authentic flavor.",
        "Microwave the fruit: To get the most juice from your lemons and limes, microwave them for about 10 seconds and then roll them firmly on the counter with your hand before squeezing.",
        "Adjusting the Ratio: The 1:1:1:1 ratio provides a balanced mix, but you can adjust the proportions of lemon, lime, and simple syrup to suit your personal taste or specific cocktail requirements.",
        "Storage: The mix will keep for a few weeks in the fridge. Discard it if you notice any mold or if it becomes cloudy. It can also be frozen for up to a month. ",
        "How to Make Sweet and Sour Mix - Bread Booze Bacon"
    ],
    "image": "https://realhousemoms.com/wp-content/uploads/Homemade-Sweet-and-Sour-Mix-Easy-Cocktail-Recipe-Real-Housemoms.jpg",
    "keywords": ["Mix", "Sweet", "Sour"],
    "source": "User Created"
}
